
{
    "type": "en",
    "menuPage": [
        {
        "specialsTitle": "Specials",
        "specialsInfo": "Buy 1 and get 1 free",
        "specialEnds": "Offer ends 08/01/2023",
        "specialItems": [
            "menu.appetizers.Shrimp Cocktail",
            "menu.appetizers.Fajita Quesadilla",
            "menu.appetizers.Chicken Jalapeño Nachos"
        ]
        }
    ],
    "navBar": [
        {
        "home": "Home",
        "menu": "Menu",
        "contact": "Contact"
        }
    ],
    "footerBar": [
        {
        "contactUsTitle": "Contact Us",
        "contactInstructions": "For reservations or any inquiries, please feel free to contact us:",
        "contactNumber": "Phone: 123-456-7890",
        "ContactEmail": "Email: customer.service@mexicankitchen.com",
        "LetConnectTitle": "Let's Connect",
        "legalTitle": "Legal",
        "privacyPolicy": "Privacy Policy",
        "accessibility": "Accessibility Statement"
        }
    ],
    "contactPage": [
        {
        "aboutTitle": "About",
        "aboutText": "Welcome to Mexican Kitchen, your destination for authentic Mexican cuisine and a vibrant dining experience. Located in the heart of Houston, our restaurant is dedicated to bringing the rich flavors, vibrant colors, and warm hospitality of Mexico to your table. At Mexican Kitchen, we believe in the power of food to create connections and celebrate culture. Our team of talented chefs combines traditional Mexican recipes with innovative techniques to present you with a truly memorable culinary experience. From street tacos to enchiladas, our menu is a carefully curated selection of iconic dishes from various regions of Mexico, each prepared with love and attention to detail. Step inside our restaurant, and you'll be transported to a lively and welcoming atmosphere that captures the essence of Mexican hospitality. Our vibrant decor, inspired by the vibrant streets of Mexico, creates an inviting ambiance for you to enjoy your dining experience with family and friends. Whether you're celebrating a special occasion or simply craving a delicious meal, our team is here to ensure that every visit to Mexican Kitchen is an unforgettable one. We take pride in sourcing the finest ingredients, ensuring that each dish is made with fresh, high-quality produce, authentic spices, and traditional cooking techniques. From savoring the flavors of our sizzling fajitas to indulging in our homemade guacamole, every bite will transport you to the heart of Mexico, awakening your taste buds and leaving you craving for more. At Mexican Kitchen, we strive to provide exceptional service, treating every guest like family. Our friendly and knowledgeable staff is always ready to assist you in selecting the perfect dish or suggesting a refreshing margarita to complement your meal. We are dedicated to creating an atmosphere where laughter, joy, and unforgettable moments are shared, making every visit a cherished memory. Whether you're a Mexican cuisine aficionado or looking to embark on a culinary adventure, we invite you to join us at Mexican Kitchen. Experience the passion, the flavors, and the spirit of Mexico as we take you on a gastronomic journey like no other. Come and be part of our extended family as we celebrate the rich tapestry of Mexican culture, one delicious plate at a time. ¡Bienvenidos a Mexican Kitchen! We can't wait to serve you and share the vibrant flavors of Mexico with you. ¡Buen provecho! (Enjoy your meal!)",
        "addressTitle": "Address",
        "hoursTitle": "Hours",
        "hoursM": "Monday 7:00 AM - 12:00 AM",
        "hoursT": "Tuesday 7:00 AM - 12:00 AM",
        "hoursW": "Wednesday 7:00 AM - 12:00 AM",
        "hoursR": "Thursday 7:00 AM - 12:00 AM",
        "hoursF": "Friday 7:00 AM - 2:00 AM",
        "hoursSat": "Saturday 7:00 AM - 2:00 AM",
        "hoursSun": "Sunday 7:00 AM - 12:00 AM"
        }
    ],
    "menu": [
        {
        "menu": [
            "Menu",
            "Appetizers",
            "Soups and Salads",
            "Tacos",
            "Enchiladas",
            "Desserts",
            "Beverages"
        ],
        "appetizers": [
            {
            "Name": "Guacamole and Chips",
            "description": "Delight in creamy guacamole paired with crispy tortilla chips for a satisfying appetizer",
            "price": "$2.99"
            },
            {
            "Name": "Queso Fundido",
            "description": "Hot melted cheese and spicy chorizo that is often served flambé",
            "price": "$5.99"
            },
            {
            "Name": "Ceviche",
            "description": "Marinated shrimp in citrus juices, combined with herbs and vegetables for a refreshing seafood experience",
            "price": "$6.99"
            },
            {
            "Name": "Taquitos",
            "description": "Savory shredded chicken wrapped in crispy tortillas",
            "price": "$4.99"
            },
            {
            "Name": "Shrimp Cocktail",
            "description": "Succulent shrimp, crisp lettuce, and tangy sauce.",
            "price": "$6.99"
            },
            {
            "Name": "Fajita Quesadilla",
            "description": "Cheesy and loaded, the big fajita quesadilla is a flavor-packed sensation.",
            "price": "$4.99"
            },
            {
            "Name": "Chicken Jalapeño Nachos",
            "description": "Nacho chips toped with grilled chicken, melted fiesta blend cheese, and jalapenos",
            "price": "$5.99"
            }
        ],
        "soupsAndSalads": [
            {
            "Name": "Tortilla Soup",
            "description": "Savory shredded chicken wrapped in crispy tortillas",
            "price": "$4.99"
            },
            {
            "Name": "Chicken Mexican Salad",
            "description": "Grilled chicken, crisp lettuce, vibrant veggies, zesty dressing",
            "price": "$4.99"
            },
            {
            "Name": "Pozole",
            "description": "Savor the flavors of Pozole: a hearty Mexican soup with tender pork, hominy, and aromatic spices",
            "price": "$5.99"
            }
        ],
        "tacos": [
            {
            "Name": "Carne Asada Tacos",
            "description": "Grilled steak in warm tortillas with fresh toppings",
            "price": "$4.99"
            },
            {
            "Name": "Al Pastor Tacos",
            "description": "Marinated pork, warm tortillas, vibrant toppings",
            "price": "$4.99"
            },
            {
            "Name": "Baja Fish Tacos",
            "description": "Crispy fish fillets, nestled in warm tortillas, topped with fresh ingredients",
            "price": "$5.99"
            },
            {
            "Name": "Vegetarian Tacos",
            "description": "Fresh veggies, savory beans, zesty toppings in warm tortillas",
            "price": "$3.99"
            }
        ],
        "enchiladas": [
            {
            "Name": "Chicken Enchiladas",
            "description": "Tender chicken wrapped in tortillas, smothered with flavorful sauce and melted cheese",
            "price": "$8.99"
            },
            {
            "Name": "Cheese and Spinach Enchiladas",
            "description": "Creamy cheese, flavorful spinach, tortillas, savory sauce",
            "price": "$6.99"
            },
            {
            "Name": "Enchiladas Suizas",
            "description": "Rolled tortillas filled with savory chicken, smothered in creamy Swiss cheese sauce",
            "price": "$7.99"
            }
        ],
        "desserts": [
            {
            "Name": "Flan",
            "description": "Creamy caramel-infused custard dessert",
            "price": "$4.99"
            },
            {
            "Name": "Churros",
            "description": "Crispy fried dough pastry, dusted with cinnamon sugar",
            "price": "$4.99"
            },
            {
            "Name": "Tres Leches Cake",
            "description": "Ultra light cake soaked in a sweet milk mixture",
            "price": "$5.99"
            }
        ],
        "beverages": [
            {
            "Name": "Margaritas",
            "description": "A refreshing blend of tequila, lime juice, and a touch of sweetness, served with a salted rim for a perfect balance of flavors",
            "price": "$5.99"
            },
            {
            "Name": "Agua Frescas",
            "description": "Refreshing and fruity beverages made with fresh ingredients like watermelon, cucumber, or hibiscus, offering a cool and revitalizing sip",
            "price": "$2.99"
            },
            {
            "Name": "Mexican Beer",
            "description": "Crisp and flavorful brews with a touch of zest and a hint of tradition",
            "price": "$3.99"
            }
        ]
        }
    ]
}